In [3]:
import numpy as np
import pandas as pd

data = {
    'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'sales': [200, 120, 340, 124, 243, 250]
}

df = pd.DataFrame(data)
df

  company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    250

# GROUP BY operations

In [10]:
df.groupby(by='company').mean()
df.groupby(by='company').max()
df.groupby(by='company').min()
df.groupby(by='company').sum()
df.groupby(by='company').std()
df.groupby(by='company').count()

         person  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [11]:
df.groupby(by='company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  246.5    4.949747  243.0  244.75  246.5  248.25  250.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [14]:
df.groupby(by='company').describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   246.500000  160.000000  232.000000
      std      4.949747   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    244.750000  140.000000  178.000000
      50%    246.500000  160.000000  232.000000
      75%    248.250000  180.000000  286.000000
      max    250.000000  200.000000  340.000000

In [15]:
# getting unique values from a dataset 
d = {
    'col1': [1,2,3,4],
    'col2': [444,555,666,444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
}
df = pd.DataFrame(d)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# UNIQUE operations

- unique
- nunique
- value_counts

In [17]:
df['col2'].unique()

array([444, 555, 666])

In [18]:
# the number of unique values
df['col2'].nunique()

3

In [19]:
# count for each unique value
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# APPLY operation

Broadcast a function to each element of an array.

In [20]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [21]:
df['col2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64